Tekla Open API Reference for Tekla Structures 2025
PolyLine Operators
The PolyLine type exposes the following members.
Operators
Name | Description
Equality
 Checks the equality of two polylines.
Inequality
 Checks the inequality of two polylines.
Top
See Also
Reference
PolyLine Class
Tekla.Structures.Geometry3d Namespace